/*
Navicat MySQL Data Transfer

Source Server         : 127.0.0.1
Source Server Version : 50505
Source Host           : 127.0.0.1:3306
Source Database       : ssm_mms

Target Server Type    : MYSQL
Target Server Version : 50505
File Encoding         : 65001

Date: 2020-01-08 21:27:31
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `agency`
-- ----------------------------
DROP TABLE IF EXISTS `agency`;
CREATE TABLE `agency` (
  `ano` char(8) NOT NULL,
  `aname` char(8) NOT NULL,
  `asex` char(10) DEFAULT NULL,
  `aphone` char(12) DEFAULT NULL,
  `aremark` varchar(50) DEFAULT NULL,
  `aid` int(11) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`ano`),
  UNIQUE KEY `ano_UNIQUE` (`ano`),
  UNIQUE KEY `aid_UNIQUE` (`aid`)
) ENGINE=InnoDB AUTO_INCREMENT=12036 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of agency
-- ----------------------------
INSERT INTO `agency` VALUES ('1000055', '王平', '男', '13587477044', '苍南县金乡镇健民药店有限公司', '9369');
INSERT INTO `agency` VALUES ('1001239', '薛小苹', '女', '18585262376', '苍南县桥墩镇百信药店有限公司', '10846');
INSERT INTO `agency` VALUES ('10018252', '黄纪元', '男', '13344497620', '温州一洲医药连锁有限公司同济店', '6452');
INSERT INTO `agency` VALUES ('10031790', '段平浩', '男', '15522442642', '浙江麦斯康莱医药有限公司', '6418');
INSERT INTO `agency` VALUES ('10068782', '林瑞道', '男', '15614675932', '瑞安市瑞诚大药房有限公司', '5163');
INSERT INTO `agency` VALUES ('10074222', '胡贝贝', '女', '13304043258', '杭州萧山同春堂医药零售有限责任公司', '7670');
INSERT INTO `agency` VALUES ('10077034', '江云琴', '女', '15541169138', '温岭市泽国广源药店', '12014');
INSERT INTO `agency` VALUES ('10078994', '黄炜明', '男', '13567438211', '浙江普泽医药有限公司', '10687');
INSERT INTO `agency` VALUES ('10085773', '陈敏芳', '女', '18615291784', '遂昌慈福堂便民药店有限公司', '6391');
INSERT INTO `agency` VALUES ('100860', '俞佳俊', '男', '13269463082', '华东医药股份有限公司', '8234');
INSERT INTO `agency` VALUES ('10103466', '王加乐', '男', '13454049693', '绍兴市上虞区梁湖镇康宁大药房', '664');
INSERT INTO `agency` VALUES ('10106824', '童亚飞', '女', '13216143974', '兰溪市云龙大药房连锁有限公司德济堂连锁店', '11994');
INSERT INTO `agency` VALUES ('10120648', '吴泼', '男', '15816279705', '台州市老百姓好心情医药连锁有限公司开发区界牌店', '431');
INSERT INTO `agency` VALUES ('10128207', '洪筱瑜', '男', '15791135259', '诸暨市盛唐医药连锁有限公司元亨药房', '1835');
INSERT INTO `agency` VALUES ('10142863', '李正日', '男', '18942258012', '宁波明天科技有限公司', '9616');
INSERT INTO `agency` VALUES ('10154715', '张秀红', '女', '15584706818', '华东医药股份有限公司广通分公司', '8156');
INSERT INTO `agency` VALUES ('10166553', '朱丽娅', '女', '15233793959', '临海市延年堂药店 ', '9891');
INSERT INTO `agency` VALUES ('10170712', '龚晓涛', '女', '18827917647', '杭州树兰弘毅大药房有限公司', '676');
INSERT INTO `agency` VALUES ('10171245', '梁霖锋', '男', '15856685664', '华东医药股份有限公司', '11336');
INSERT INTO `agency` VALUES ('10177483', '俞青青', '女', '15194211241', '余姚市同济堂药品零售连锁有限公司舜水南路店', '8721');
INSERT INTO `agency` VALUES ('10178582', '陆晓春', '女', '13811503721', '嘉兴市戴梦得购物中心有限公司南湖旅游商场', '9820');
INSERT INTO `agency` VALUES ('10184534', '马才龙', '男', '13712310162', '回音必集团浙江医药有限公司', '9545');
INSERT INTO `agency` VALUES ('10191877', '杨海锋', '男', '13463346417', '国药控股温州有限公司', '9879');
INSERT INTO `agency` VALUES ('10192604', '何建晓', '女', '15913318098', '温州叶同仁医药连锁有限公司梧田店', '7831');
INSERT INTO `agency` VALUES ('10200631', '李双双', '女', '15548205489', '玉环县健龙堂药店', '7148');
INSERT INTO `agency` VALUES ('10203496', '赵建飞', '女', '15373773453', '浙江供销超市有限公司马山店', '10812');
INSERT INTO `agency` VALUES ('10206742', '张萍', '女', '15851543401', '绍兴易心堂大药房连锁有限公司藕舫路店', '2311');
INSERT INTO `agency` VALUES ('10212877', '陈顺才', '男', '13367438879', '桐乡市景天医药连锁有限公司湘溪药店', '4735');
INSERT INTO `agency` VALUES ('10229408', '马文娟', '女', '15290738275', '绍兴市镜湖新区健生堂大药房', '3707');
INSERT INTO `agency` VALUES ('10239948', '范贵星', '男', '18836660742', '诸暨市盛唐医药连锁有限公司康明药店', '1428');
INSERT INTO `agency` VALUES ('10247905', '汪超良', '男', '18946251609', '台州市路桥民泰大药房', '4285');
INSERT INTO `agency` VALUES ('10256144', '李荣', '女', '13392881594', '金华柏康大药房连锁有限公司下马滩药店', '1871');
INSERT INTO `agency` VALUES ('10281079', '陈勤英', '女', '13938268675', '温岭市康康医药连锁有限公司石塘上马店', '3860');
INSERT INTO `agency` VALUES ('10285267', '余国幸', '女', '15221496227', '康德乐（浙江）医药有限公司', '6751');
INSERT INTO `agency` VALUES ('10290633', '孙坚敏', '男', '13733987746', '宁波市镇海医药药材有限责任公司外滩分公司', '10893');
INSERT INTO `agency` VALUES ('10299399', '郝利平', '女', '15363944244', '温州一正药房连锁有限公司东瓯店', '2069');
INSERT INTO `agency` VALUES ('10304550', '黄海榕', '女', '15335794224', '浙江省嵊州市医药药材总公司', '11738');
INSERT INTO `agency` VALUES ('10313734', '郑明明', '男', '13288359151', '金华市尖峰大药房连锁有限公司永生堂药店', '4725');
INSERT INTO `agency` VALUES ('1032144', '周余斌', '男', '18630526386', '浙江亿升药业有限公司', '10817');
INSERT INTO `agency` VALUES ('10329282', '楼凌霞', '女', '15208620640', '浙江省临安市医药药材有限公司', '10841');
INSERT INTO `agency` VALUES ('10342830', '陈洁余', '女', '13153612044', '浙江长红大药房连锁有限公司鱼圻塘店', '2271');
INSERT INTO `agency` VALUES ('10355718', '许力', '男', '13169184381', '老百姓大药房连锁（浙江）有限公司义乌江东店', '3732');
INSERT INTO `agency` VALUES ('10362417', '葛海芬', '女', '15287086040', '金华市泰来医药零售连锁有限公司安地药店', '6004');
INSERT INTO `agency` VALUES ('10376381', '叶菊爱', '女', '18951887535', '浙江省国投医药有限公司', '10395');
INSERT INTO `agency` VALUES ('10378347', '陈军飞', '女', '15254839459', '台州市椒江百康堂药店', '4990');
INSERT INTO `agency` VALUES ('10380319', '刘英', '女', '13502148506', '温岭市诚益堂大药房', '5466');
INSERT INTO `agency` VALUES ('10381157', '江小红', '女', '18565792843', '嘉善长红大药房连锁有限公司车站路店', '8379');
INSERT INTO `agency` VALUES ('10386120', '夏燕君', '女', '13746565636', '温州嘉恩医药连锁有限公司锦绣店', '2284');
INSERT INTO `agency` VALUES ('10387069', '方岳芳', '男', '13192665510', '义乌市众生医药有限公司', '9475');
INSERT INTO `agency` VALUES ('10388836', '周丽侬', '女', '15366077247', '余姚市同济堂药品零售连锁有限公司泗门店', '8714');
INSERT INTO `agency` VALUES ('10397752', '俞兆丰', '男', '13362084313', '绍兴震元医药经营有限责任公司', '10496');
INSERT INTO `agency` VALUES ('10398135', '蒋女', '女', '18816043104', '诸暨市盛唐医药连锁有限公司耀江药店', '2432');
INSERT INTO `agency` VALUES ('10404073', '许王璧', '女', '15830134808', '平阳县鳌江镇葆生堂大药房（普通合伙）', '9796');
INSERT INTO `agency` VALUES ('10430896', '徐旭', '男', '15195664580', '浙江英特生物制品营销有限公司', '8006');
INSERT INTO `agency` VALUES ('10434201', '陈汉钰', '男', '13158474073', '浙江鼎盛医药有限公司', '8683');
INSERT INTO `agency` VALUES ('10440664', '张雪梅', '女', '18666859537', '江山市云水药店', '8467');
INSERT INTO `agency` VALUES ('10441338', '章晓黎', '女', '15901656898', '浙江鸿汇医药物流有限公司', '7924');
INSERT INTO `agency` VALUES ('10450915', '金烨', '男', '13631057343', '浙江英特药业有限责任公司电子商务分公司', '10766');
INSERT INTO `agency` VALUES ('10454657', '杨慧芳', '女', '13433888520', '义乌市保济堂医药连锁有限公司后宅店', '1524');
INSERT INTO `agency` VALUES ('10461560', '谢爱娥', '女', '15600575042', '绍兴市柯桥和煦堂大药房有限公司', '333');
INSERT INTO `agency` VALUES ('10464659', '周福水', '男', '13523073554', '嵊州市西港药房有限公司', '5452');
INSERT INTO `agency` VALUES ('10467755', '祝敏', '男', '18745773147', '诸暨市盛堂医药连锁有限公司璜山大药房', '7699');
INSERT INTO `agency` VALUES ('1046856', '孟培兴', '男', '13180187304', '江山市石门毛友文药店', '10382');
INSERT INTO `agency` VALUES ('1049036', '俞世恩', '男', '13133767407', '杭州诚丰生物医药有限公司', '7625');
INSERT INTO `agency` VALUES ('10498359', '王美仙', '女', '15759336523', '台州恩泽大药房连锁有限公司仙居店', '160');
INSERT INTO `agency` VALUES ('10515843', '陈秀凤', '女', '18852703223', '玉环县康复医药零售有限公司广陵路大药房', '7251');
INSERT INTO `agency` VALUES ('10516464', '陈其良', '男', '18776105039', '华东医药股份有限公司新药特药分公司', '11483');
INSERT INTO `agency` VALUES ('10522519', '王涛', '男', '15519595304', '新昌县维信生物技术有限公司', '9383');
INSERT INTO `agency` VALUES ('10538131', '史敏莉', '女', '13211673527', '长兴惠民大药房泗安振兴大道分店', '1397');
INSERT INTO `agency` VALUES ('10542229', '鲁英', '女', '13505067731', '瑞安市中滔中药房有限公司 ', '10176');
INSERT INTO `agency` VALUES ('10543202', '张强', '男', '13220000050', '绍兴柯桥春秋大药房有限公司', '3010');
INSERT INTO `agency` VALUES ('10545409', '陈志良', '男', '13631566297', '浙江省临海医药有限公司', '10628');
INSERT INTO `agency` VALUES ('10545504', '傅俊涛', '男', '18676123606', '金华市医药有限公司', '2776');

-- ----------------------------
-- Table structure for `client`
-- ----------------------------
DROP TABLE IF EXISTS `client`;
CREATE TABLE `client` (
  `cno` char(10) NOT NULL,
  `cname` varchar(8) DEFAULT NULL,
  `csex` char(8) DEFAULT NULL,
  `cage` char(4) DEFAULT NULL,
  `caddress` varchar(50) DEFAULT NULL,
  `cphone` varchar(20) DEFAULT NULL,
  `csymptom` varchar(50) DEFAULT NULL,
  `mno` char(12) DEFAULT NULL,
  `ano` char(8) DEFAULT NULL,
  `cdate` datetime DEFAULT NULL,
  `cremark` varchar(45) DEFAULT NULL,
  `cid` int(11) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`cno`),
  UNIQUE KEY `cno_UNIQUE` (`cno`),
  UNIQUE KEY `cid_UNIQUE` (`cid`),
  KEY `mno` (`mno`),
  KEY `ano` (`ano`),
  CONSTRAINT `client_ibfk_1` FOREIGN KEY (`mno`) REFERENCES `medicine` (`mno`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `client_ibfk_2` FOREIGN KEY (`ano`) REFERENCES `agency` (`ano`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of client
-- ----------------------------
INSERT INTO `client` VALUES ('4396', '小明', '男', '16', '广东省汕头市濠江区广奥街道', '15875495004', '病名为爱', '1001044516', '10074222', '2018-12-22 00:00:00', '需要治疗', '1');

-- ----------------------------
-- Table structure for `medicine`
-- ----------------------------
DROP TABLE IF EXISTS `medicine`;
CREATE TABLE `medicine` (
  `mno` char(12) NOT NULL,
  `mname` varchar(50) DEFAULT NULL,
  `mmode` char(2) DEFAULT NULL,
  `mefficacy` varchar(1000) DEFAULT NULL,
  `mid` int(11) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`mno`),
  UNIQUE KEY `mno_UNIQUE` (`mno`),
  UNIQUE KEY `mid_UNIQUE` (`mid`)
) ENGINE=InnoDB AUTO_INCREMENT=4816 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of medicine
-- ----------------------------
INSERT INTO `medicine` VALUES ('311742450', '肠胃宁胶囊', '内服', '　　补脾胃，益肺气。用于脾胃虚弱，食少便溏，气短咳嗽，肢倦乏力。', '3201');
INSERT INTO `medicine` VALUES ('312084668', '阿司匹林肠溶片', '内服', '解热镇痛类药，用于发热、头痛、关节痛等。', '2261');
INSERT INTO `medicine` VALUES ('312218435', '润肠胶囊', '内服', '用于治疗习惯性顽固性便秘。', '3914');
INSERT INTO `medicine` VALUES ('336960592', '吲哚美辛栓', '内服', '用于风湿性关节炎、类风湿性关节炎、强直性脊柱炎、骨关节炎及急性痛风发作等。', '79');
INSERT INTO `medicine` VALUES ('338241432', '贝诺酯片', '内服', '辛凉解表，清热解毒。用于风热感冒及温病之发热，微恶风寒，头身痛，口干而渴，鼻塞涕浊，咽喉红肿疼痛，咳嗽，痰黄粘稠。', '1572');
INSERT INTO `medicine` VALUES ('33844543', '复方氨酚烷胺胶囊', '内服', '用于高热时的解热，也可用于头痛、偏头痛、肌肉痛、关节痛、痛经等。本品亦有较强的抗风湿作用，可用于急性风湿性关节炎，但因本品有可能引起严重的不良反应，很...', '1497');
INSERT INTO `medicine` VALUES ('33848654', '养胃舒胶囊', '内服', '扶正固体，滋阴养胃，调理中焦，行气消导。用于慢性萎缩性胃炎、慢性胃炎所引起的胃脘热胀痛，手足心热，口干、口苦，纳差，消瘦等症。', '2626');
INSERT INTO `medicine` VALUES ('338852753', '血平片', '内服', '清热除湿，化浊通便。用于大肠湿热所致的便秘，口臭，牙龈肿痛。', '3812');
INSERT INTO `medicine` VALUES ('339113726', '金佛酒', '内服', '理气解郁，宽胸活血，养血健胃。用于脘闷肋胀，食欲减退，睡眠不佳。', '2885');
INSERT INTO `medicine` VALUES ('339235591', '嘉龙牌三叶通便茶', '内服', '解热镇痛类药，用于发热、头痛、关节痛等。', '1060');
INSERT INTO `medicine` VALUES ('339374426', '六神曲', '内服', '健脾和胃，消食调中。用于脾胃虚弱，饮食停滞，胸痞腹胀，小儿食积。', '2799');
INSERT INTO `medicine` VALUES ('340065139', '安坤胶囊', '内服', '本品为天然蒙脱石微粒粉剂，具有层纹状结构和非均匀性电荷分布，对消化道内的病毒、病菌及其产生的毒素、气体等有极强的固定、抑制作用，使其失去致病作用', '3961');
INSERT INTO `medicine` VALUES ('340537457', '奥一麦(注射用盐酸昂丹司琼)', '内服', '益气、化瘀、止痛。用于胃及十二指肠溃疡。', '4199');
INSERT INTO `medicine` VALUES ('340850333', '血脂灵胶囊', '内服', '疏风止痛。用于风邪头痛，或有恶寒，发热，鼻塞。', '1225');
INSERT INTO `medicine` VALUES ('341115280', '多瑞(水杨酸二乙胺软膏)', '内服', '用于风湿及类风湿关节炎。', '180');
INSERT INTO `medicine` VALUES ('341184020', '阿司匹林肠溶片', '内服', '解热镇痛类药，用于发热、头痛、关节痛等。', '2312');
INSERT INTO `medicine` VALUES ('341380769', '信谊(陈香露白露片)', '内服', '2.用于阻塞性黄疸及慢性胆囊炎。', '2982');
INSERT INTO `medicine` VALUES ('342112533', '消食退热糖浆', '内服', '滋补肝肾，养益精血，扶正固本，通络定痛，健脾豁痰，明目生津，润肠通便。用于各型高血脂症，心脑血管硬化，单纯性肥胖，习惯性便秘，痔疮出血。', '4658');
INSERT INTO `medicine` VALUES ('342480165', '清肝利胆口服液', '内服', '暂无数据', '811');
INSERT INTO `medicine` VALUES ('343671420', '藿香正气片', '内服', '宣肺气，散风寒，镇咳祛痰。用于感冒风寒，咳嗽气逆。', '1494');
INSERT INTO `medicine` VALUES ('344027941', '一清软胶囊', '内服', '用于术后止痛、癌症痛、急性外伤痛。亦用于急性胃炎、胆道蛔虫症、输尿管结石等内脏平滑肌绞痛。', '4458');
INSERT INTO `medicine` VALUES ('344254063', '解毒活血栓', '内服', '清凉散热，醒脑提神，止痒止痛。用于感冒头痛，中暑，晕车，蚊虫叮咬。', '719');
INSERT INTO `medicine` VALUES ('344315555', '氨酚比林注射液', '内服', '适用于1岁以上儿童各种原因引起的发热，以及各种轻、中度疼痛的治疗。', '640');
INSERT INTO `medicine` VALUES ('344870166', '邦消安(六味安消胶囊)', '内服', '和胃健脾，导滞消积，行血止痛。用于胃痛胀满，消化不良，便秘，痛经。', '2619');
INSERT INTO `medicine` VALUES ('345163176', '利动(乳果糖口服溶液)', '内服', '胃食管反流性疾病（GERD）', '3024');
INSERT INTO `medicine` VALUES ('345366124', '去痛片', '内服', '疏风散寒，解表清热。用于风寒感冒，头痛发热，恶寒身痛，鼻流清涕，咳嗽咽干。', '1630');
INSERT INTO `medicine` VALUES ('345440491', '山楂内金口服液', '内服', '十二指肠溃疡、胃溃疡、返流性食管炎，卓一艾氏综合征。', '3717');
INSERT INTO `medicine` VALUES ('34644064', '盐酸洛哌丁胺胶囊', '内服', '清热凉血，消肿止痛。用于盆腔炎，附件炎，子宫内膜炎等引起的带下、腹痛。', '3557');
INSERT INTO `medicine` VALUES ('346502430', '欧意(清热解毒软胶囊)', '内服', '清热解毒。用于热毒壅盛所致发热面赤，烦燥口渴，咽喉肿痛；流感、上呼吸道感染见上述证候者。', '73');
INSERT INTO `medicine` VALUES ('346525139', '散列通(复方对乙酰氨基酚片(Ⅱ))', '内服', '用于普通感冒或流行性感冒引起的发热，也用于缓解轻至中度疼痛如头痛、关节痛、偏头痛、牙痛、肌肉痛、神经痛、痛经。', '332');
INSERT INTO `medicine` VALUES ('347173403', '盐酸小檗碱片', '内服', '用于治疗肠道感染、腹泻。', '2609');
INSERT INTO `medicine` VALUES ('347774592', '呋喃唑酮片', '内服', '用于预防和治疗烟酸缺乏症，如糙皮病、口炎、舌炎。', '4342');
INSERT INTO `medicine` VALUES ('348004370', '健儿清解液', '内服', '益气健脾、固冲止血。用于脾气虚损，冲任不固所致的月经过多、经期延长、淋漓不净，色淡质稀，面色白光白，体倦乏力，纳少，气短懒言。', '3072');
INSERT INTO `medicine` VALUES ('350434821', '复方对乙酰氨基酚金银花注射液', '内服', '解热镇痛。用于感冒引起的头痛，发热，鼻塞。流涕，咽痛等。', '1368');
INSERT INTO `medicine` VALUES ('350902949', '双分伪麻片（日用片）美扑伪麻片（夜用片）(日夜百服咛)', '内服', '用于风湿性关节炎、类风湿性关节炎、强直性脊柱炎、骨关节炎及急性痛风发作等。', '1240');
INSERT INTO `medicine` VALUES ('351309689', '香连胶囊', '内服', '清热燥湿，行气止痛。用于泄泻腹痛，便黄而粘。', '2774');
INSERT INTO `medicine` VALUES ('351831049', '急支糖浆', '内服', '清热化痰，宣肺止咳。用于外感风热所致的咳嗽，症见发热、恶寒、胸膈满闷、咳嗽咽痛；急性支气管炎、慢性支气管炎急性发作见上述症候者。', '336');
INSERT INTO `medicine` VALUES ('351831962', '高舒达(法莫替丁片)', '内服', '用于缓解胃酸过多所致的胃痛、胃灼热感（烧心）、反酸。', '2667');
INSERT INTO `medicine` VALUES ('351855391', '甘羟铝片', '内服', '用于胃及十二指肠溃疡、慢性浅表性胃炎。', '2778');
INSERT INTO `medicine` VALUES ('352502025', '小建中片', '内服', '1．溶血链球菌、肺炎链球菌、葡萄球菌或流感嗜血杆菌所致中耳炎、鼻窦炎、咽炎、扁桃体炎等上呼...', '3623');
INSERT INTO `medicine` VALUES ('353126518', '复方铝酸铋片', '内服', '用于便秘的治疗、腹部X线检查或内窥镜检查前清洁肠道使肠道排空，以及手术前后清洁肠道用。', '3925');
INSERT INTO `medicine` VALUES ('353154805', '整肠生(地衣芽孢杆菌活菌胶囊)', '内服', '消积化滞，行气止痛。用于气郁食滞所致的胸胁胀满、胃脘疼痛、嗳气呕恶、食少纳呆。', '2986');
INSERT INTO `medicine` VALUES ('353208437', '健儿乐颗粒', '内服', '用于治疗胃及十二指肠溃疡。', '4523');
INSERT INTO `medicine` VALUES ('353425861', '宜利妙(对乙酰氨基酚干混悬剂)', '内服', '辛凉解表，清热解毒。用于流行性感冒引起的发热头痛、咳嗽、口干、咽喉疼痛。', '1802');
INSERT INTO `medicine` VALUES ('353539745', '固本益肠片', '内服', '健脾温肾，涩肠止泻。用于脾虚或脾肾阳虚所致慢性泄泻，证见慢性腹痛腹泻、大便清稀、食少腹胀、腰酸乏力、形寒肢冷。', '2641');
INSERT INTO `medicine` VALUES ('354143575', '复方罗汉果止咳片', '内服', '清热凉血。适用于血热妄行所致的皮下紫斑，症见皮肤出现散在青紫斑点或斑块，舌红，苔黄，脉数等；原发性血小板减少性紫癫见上述血热证候者。', '927');
INSERT INTO `medicine` VALUES ('354948134', '十滴水', '内服', '1.缓解类风湿关节炎、骨关节炎。脊柱关节病、痛风性关节炎、风湿性关节炎等各种慢性关节炎的急性发作期或持续性的关节肿痛症状；2.各种软组织风湿性疼痛，如肩痛...', '2008');
INSERT INTO `medicine` VALUES ('355182972', '复方金刚烷胺氨基比林片', '内服', '用于预防，治疗流行性感冒，对其他原因引起的高热，也具有良好的退热作用。', '560');
INSERT INTO `medicine` VALUES ('355760966', '法莫替丁片', '内服', '健脾益胃，理气消食。用于小儿饮食不节损伤脾胃引起的纳呆食少，脘胀腹满，手足心热，自汗。', '3880');
INSERT INTO `medicine` VALUES ('355944138', '芩连胶囊', '内服', '柔肝和胃，散瘀，缓急止痛。用于肝胃不和、瘀血阻络所致的胃脘疼痛、连及两胁、嗳气、泛酸；慢性胃炎见上述证候者。', '4587');
INSERT INTO `medicine` VALUES ('355977084', '善清(苯甲酸利扎曲普坦片)', '内服', '用于发热、头痛、神经痛、牙痛及手术后轻中度疼痛等。', '1039');
INSERT INTO `medicine` VALUES ('356521867', '胃刻宁片', '内服', '壮阳补肾。用于肾阳不足引起的性欲淡漠，阳痿滑泄，腰腿酸痛，肾囊湿冷，精神萎靡，食欲不振等症。', '3578');
INSERT INTO `medicine` VALUES ('357396767', '儿童科达琳(儿童复方氨酚肾素片)', '内服', '本品系感冒对症治疗药，适用于治疗由感冒引起的发热、头痛、周身四肢酸痛、喷嚏、流涕、鼻塞、咳嗽等症状。', '1251');
INSERT INTO `medicine` VALUES ('3574152', '唯迪亚(胶体果胶铋颗粒)', '内服', '治疗静脉淋巴功能不全相关的各种症状（腿部沉重、疼痛、晨起酸胀不适感）。治疗静脉曲张，下肢溃疡和痔疮。急性痔发作有关的各种症状。', '3671');
INSERT INTO `medicine` VALUES ('357739056', '胃舒宁胶囊', '内服', '疏肝、健胃、清热、愈溃疡、消肿。用于“木布”病迁不愈，胃脘嘈杂、灼痛，肝热痛，消化不良，呃逆，吐泻胆汁，坏血和烟汁样物(即赤白痢疾)，急腹痛、黄水病、脏...', '3092');
INSERT INTO `medicine` VALUES ('357821563', '养胃颗粒', '内服', '本品适用于敏感致病菌所致的下列感染：1.呼吸道感染:上呼吸道感染、细菌性肺炎、支气管炎等；2.泌尿系统感染:膀胱炎、尿道炎、肾盂肾炎、前列腺炎等；3.消化道感...', '4807');
INSERT INTO `medicine` VALUES ('35811397', '香砂平胃颗粒', '内服', '适用于慢性浅表性胃炎及胃溃疡。', '4666');
INSERT INTO `medicine` VALUES ('358333495', '活胃散', '内服', '理气和胃，降逆止呕。用于肝郁气逆，脾胃不和引起：胸肋胀满，胃脘疼痛，气逆嘈杂，呕吐吞酸，及消化不良见上述证候者。', '2634');
INSERT INTO `medicine` VALUES ('358445359', '风油精', '内服', '疏风清热，解毒消肿，凉血利胆。用于感冒发热头痛，咽喉红肿，耳下肿痛，肋痛黄疸等症，及流感、腮腺炎、急性病毒性肝炎见有上述症状者。', '1768');
INSERT INTO `medicine` VALUES ('359453386', '解热感冒片', '内服', '清热解表。用于外感风寒引起的头痛，鼻塞流涕，发烧怕冷，咳嗽音哑，咽喉干痛。', '295');
INSERT INTO `medicine` VALUES ('359499081', '清宣止咳颗粒', '内服', '疏风清热，宣肺止咳。用于小儿外感风热咳嗽，证见：咳嗽，咯痰，发热或鼻塞，流涕，微恶风寒，咽红或痛。', '401');
INSERT INTO `medicine` VALUES ('359564620', '阿拉坦五味丸', '内服', '清热燥湿止泻。用于急性腹泻属湿热证者，症见：大便次数增多，便稀溏，泻泄急迫或不畅，肛门灼热，烦热口渴，腹痛，小便黄赤，舌苔腻。', '3194');
INSERT INTO `medicine` VALUES ('360060922', '清感穿心莲胶囊', '内服', '适用于头痛、消化系统疾病引起的内脏痛、月经痛以及助眠。', '1180');
INSERT INTO `medicine` VALUES ('360558408', '对乙酰氨基酚片', '内服', '疏风清热，宣肺止咳。用于风热感冒初起，头痛，咳嗽，口干，咽痛。', '2108');
INSERT INTO `medicine` VALUES ('361212624', '红色正金软膏', '内服', '清热，消炎，解毒。用于风热感冒，流感，咽喉肿痛，痢疾肠炎，疔疮肿痛。', '1526');
INSERT INTO `medicine` VALUES ('361317385', '倍爱牌大豆乳清蛋白粉', '内服', '抑制血小板聚成，防止血栓形成，治疗和预防短暂脑缺血发作、脑血栓、冠心病、心肌梗塞、偏头疼、人工心脏瓣膜，动静脉漏和其他手术后的血栓形成，血栓闭塞性脉管...', '1465');
INSERT INTO `medicine` VALUES ('361466466', '胃蛋白酶片', '内服', '用于消化不良，消化功能减退及某些慢性疾病所引起的胃蛋白酶缺乏。', '2749');
INSERT INTO `medicine` VALUES ('362530100', '怡美力(尼美舒利片)', '内服', '散风清热，祛寒止咳。用于感冒，咳嗽，头痛，咽喉肿痛。', '1395');
INSERT INTO `medicine` VALUES ('362831352', '复方氨酚苯海拉明片', '内服', '祛风湿、止痛。用于头痛，风湿痛，神经痛，扭伤及肌肉酸痛。', '2548');
INSERT INTO `medicine` VALUES ('363033017', '十一味金色丸', '内服', '中医：清热解毒，利湿止泻。用于胃肠湿热所致的腹泻、腹胀、腹痛，急性肠炎见上述症状者。', '3964');
INSERT INTO `medicine` VALUES ('363161981', '盐酸环丙沙星片', '内服', '用于敏感菌引起的（1）泌尿生殖系统感染，包括单纯性、复杂性尿路感染、细菌性前列腺炎、淋病奈瑟菌尿道炎或宫颈炎（包括产酶株所致者）。（2）呼吸道感染，包括...', '4262');
INSERT INTO `medicine` VALUES ('363219241', '对乙酰氨基酚片', '内服', '解热镇痛类药，用于发热、头痛、关节痛等。', '2224');
INSERT INTO `medicine` VALUES ('363596794', '感冒清热颗粒', '内服', '解热镇痛类药，用于发热、头痛、关节痛等。', '1946');
INSERT INTO `medicine` VALUES ('364761331', '桑菊感冒合剂', '内服', '用于普通感冒或流行性感冒引起的发热，也用于缓解轻至中度疼痛如头痛、关节痛、偏头痛、牙痛、肌肉痛、神经痛、痛经。', '1750');
INSERT INTO `medicine` VALUES ('365002291', '通宣理肺丸', '内服', '疏风解表，清热解毒。用于风热感冒，症见发热头痛、咳嗽口干、咽喉疼痛。', '1889');
INSERT INTO `medicine` VALUES ('365502333', '小儿复方氨酚烷胺片', '内服', '解热镇痛类药，用于发热、头痛、关节痛等。', '2264');
INSERT INTO `medicine` VALUES ('365523994', '胶体酒石酸铋胶囊', '内服', '本品适用于治疗消化性溃疡，特别是幽门螺杆菌相关性溃疡，亦可用于慢性结肠炎，溃疡性结肠炎所致腹泻及慢性浅表性和萎缩性胃炎。', '2636');
INSERT INTO `medicine` VALUES ('36610029', '复方贝母氯化铵片', '内服', '疏风解表，清热解毒。用于风热感冒，症见发热头痛、咳嗽口干、咽喉疼痛。', '1649');
INSERT INTO `medicine` VALUES ('366157783', '保和口服液', '内服', '温中补虚，缓急止痛。用于脾胃虚寒，脘腹疼痛，喜温喜按，嘈杂吞酸，食少心悸及腹泻与便秘交替症状的慢性结肠炎，胃及十二指肠溃疡等。', '4664');
INSERT INTO `medicine` VALUES ('366293752', '布洛芬片', '内服', '适用于缓解普通感冒及流行性感冒引起的发热、头痛、四肢酸痛、打喷嚏、流鼻涕、鼻塞、咽痛等症状。', '1589');
INSERT INTO `medicine` VALUES ('36632602', '四季感冒片', '内服', '四季风寒感冒引起的发热头痛，鼻流清涕，咳嗽口干，咽喉疼痛，恶心厌食。', '654');
INSERT INTO `medicine` VALUES ('366489163', '康和药业(童康片)', '内服', '　　补中益气，升阳举陷。用于脾胃虚弱、中气下陷所致的泄泻、脱肛、阴挺，症见体倦乏力、食少腹胀、便溏久泻、肛门下坠或脱肛、子宫脱垂。', '3238');
INSERT INTO `medicine` VALUES ('366714045', '阿莫西林分散片', '内服', '治疗和预防急、慢性腹泻造成的轻度脱水。', '3158');
INSERT INTO `medicine` VALUES ('368070060', '小儿氨酚黄那敏颗粒', '内服', '疏风解表，清热解毒。用于外感风热所致的感冒，症见发热、咳嗽、咽痛。', '1986');
INSERT INTO `medicine` VALUES ('368125656', '三七血伤宁胶囊', '内服', '1.镇痛:适用于消化系统疾病引起的内脏痛（如胃溃疡及十二指肠溃疡的疼痛）、一般性头痛、月经痛、分娩后宫缩痛。2.镇静、催眠:适用于紧张性疼痛或因疼痛所致的失...', '3430');
INSERT INTO `medicine` VALUES ('368680068', '小儿氨酚烷胺颗粒', '内服', '用于婴幼儿感染性疾病及其它疾病引起的发热。', '769');
INSERT INTO `medicine` VALUES ('368714390', '枸橼酸铋钾胶囊', '内服', '彝医：嗨补色扎诺，斯希。中医：清肠止痢。用丁大肠湿热蕴结所致的肠炎、痢疾。', '3453');
INSERT INTO `medicine` VALUES ('368807753', '氨酚伪麻那敏咀嚼片', '内服', '清热解毒，抗菌消炎。用于治疗各种原因引起的感染及炎症。如上呼吸道感染、急性扁桃体炎、病毒性肺炎等疾病引起的发热、胸痛、咳嗽、咽喉红肿疼痛等。', '1794');
INSERT INTO `medicine` VALUES ('369567332', '通便灵胶囊', '内服', '消食导滞和胃。用于食积停滞，脘腹胀满，嗳腐吞酸，不欲饮食。', '4656');
INSERT INTO `medicine` VALUES ('369656474', '来弗斯(盐酸左氧氟沙星氯化钠注射液)', '内服', '清热养胃，行气止痛。用于胃热气滞所致的脘腹热痛，胸胁胀满，食欲不振，嗳气吞酸，以及慢性浅表性胃炎见上述证候者。', '4091');
INSERT INTO `medicine` VALUES ('370273363', '香连丸', '内服', '清热燥湿，行气止痛。用于泄泻腹痛，便黄而粘。', '2825');
INSERT INTO `medicine` VALUES ('370275916', '隔山消积颗粒', '内服', '温中散寒，理气止痛，和胃止呕。用于胃脘疼痛，慢性胃炎，胃酸过多，胃及十二脂肠溃疡。', '3566');
INSERT INTO `medicine` VALUES ('370529149', '爱尼(奥美拉唑肠溶片)', '内服', '养阴和胃。用于胃脘疼痛，痞满，腹胀。', '4098');
INSERT INTO `medicine` VALUES ('370697632', '丹纾(注射用盐酸丙帕他莫)', '内服', '用于缓解感冒或季节性过敏性鼻炎引起的打喷嚏、流鼻涕、鼻塞、咽喉不适、乏力、发热、肌肉酸痛、头痛等症状', '1492');
INSERT INTO `medicine` VALUES ('371882172', '圣诺安(奥硝唑氯化钠注射液)', '内服', '用于消化不良，乳食不进，腹痛腹泻。', '4667');
INSERT INTO `medicine` VALUES ('37189406', '清热解毒口服液', '内服', '清热解毒。用于热毒壅盛所致的发热面赤、烦躁口渴、咽喉肿痛；流感、上呼吸道感染见上述证候者。', '46');
INSERT INTO `medicine` VALUES ('372537453', '阿司匹林肠溶片', '内服', '抑制血小板聚成，防止血栓形成，治疗和预防短暂脑缺血发作、脑血栓、冠心病、心肌梗塞、偏头疼、人工心脏瓣膜，动静脉漏和其他手术后的血栓形成，血栓闭塞性脉管...', '2284');
INSERT INTO `medicine` VALUES ('372880290', '开胃健脾丸', '内服', '主要用于早期妊娠的人工流产手术，诊断性刮宫术、清宫术、节育环放取手术及子宫内窥镜检查手术的镇痛，也可用于宫腔手术后的镇痛，痛经、痔疮痛。', '4594');
INSERT INTO `medicine` VALUES ('373228846', '化积口服液', '内服', '清热泻火，消炎止痢。用于急性扁桃腺炎，细菌性肺炎，急性结膜炎，中耳炎，疖痈瘰疬，急性乳腺炎，肠炎，细菌性痢疾及急性尿道感染。', '3382');
INSERT INTO `medicine` VALUES ('373263673', '柴黄片', '内服', '抑制血小板聚成，防止血栓形成，治疗和预防短暂脑缺血发作、脑血栓、冠心病、心肌梗塞、偏头疼、人工心脏瓣膜，动静脉漏和其他手术后的血栓形成，血栓闭塞性脉管...', '2487');
INSERT INTO `medicine` VALUES ('373636896', '悉复欢(盐酸环丙沙星片)', '内服', '用于耐青霉素的葡萄球菌、链球菌、肺炎球菌、大肠杆菌等的感染。', '4712');
INSERT INTO `medicine` VALUES ('374329580', '恒邦(多潘立酮片)', '内服', '清热利湿，化瘀止痛。用于湿热瘀阻所致妇女带下，色黄质粘稠或如豆渣状，气臭，少腹、腰骶疼痛，舌暗苔黄腻等症，及慢性盆腔炎见上述证候者。', '3875');
INSERT INTO `medicine` VALUES ('375521020', '安乃近片', '内服', '解热镇痛药。用于发热、疼痛等。', '607');
INSERT INTO `medicine` VALUES ('376027108', '桑菊感冒片', '内服', '滋阴潜阳，祛风，强筋骨。用于一般性头痛，手足麻木，慢性腰腿酸痛。', '1377');
INSERT INTO `medicine` VALUES ('376092382', '藿香正气丸', '内服', '疏风清热，宣肺止咳。用于风热感冒初起，头痛，咳嗽，口干，咽痛。', '1534');
INSERT INTO `medicine` VALUES ('376331581', '头风痛胶囊', '内服', '清热解毒。用于热毒壅盛所致的发热面赤、烦躁口渴、咽喉肿痛；流感、上呼吸道感染见上述证候者。', '1064');
INSERT INTO `medicine` VALUES ('376694762', '必理通(对乙酰氨基酚片)', '内服', '本品适用于各种原因引起的发热（感冒发烧类）。适用于轻、中度非炎症性疼痛，包括头痛、关节痛、肌肉骨骼疼痛、神经痛、牙痛、痛经、创伤性疼痛、应急性疼痛、腰...', '887');
INSERT INTO `medicine` VALUES ('377126442', '解毒止泻片', '内服', '清热利湿，行气。用于大肠湿热所致的腹泻，症见大便泄泻、腹痛腹胀；腹泻、小儿消化不良见上述证侯者。', '3933');
INSERT INTO `medicine` VALUES ('377857591', '苦胆草片', '内服', '用于目赤口燥，咽喉肿痛。', '105');
INSERT INTO `medicine` VALUES ('377976316', '祛风止痛片', '内服', '养血祛风，散寒止痛。用于风寒头痛，血虚头痛，血瘀头痛。', '1359');
INSERT INTO `medicine` VALUES ('378149264', '雷赛隆(盐酸格拉司琼注射液)', '内服', '凉血止血。用于咯血，衄血，尿血，便血，崩漏。', '4631');
INSERT INTO `medicine` VALUES ('378443669', '感冒疏风颗粒', '内服', '适用于缓解普通感冒及流行性感冒引起的发热、头痛、四肢酸痛、打喷嚏、流鼻涕、鼻塞、咽痛等症状。', '1416');
INSERT INTO `medicine` VALUES ('378752878', '阿司匹林肠溶片', '内服', '解热镇痛类药，用于发热、头痛、关节痛等。', '2195');
INSERT INTO `medicine` VALUES ('379544849', '快胃片', '内服', '2.大肠埃希菌、奇异变形杆菌或粪肠球菌所致的泌尿生殖...', '3470');
INSERT INTO `medicine` VALUES ('379787735', '阿司匹林肠溶片', '内服', '本品用于下肢慢性动脉炎（二期）的补充治疗（注：此适应症是基于尼麦角林可改善病人的行走距离的研究结果）。改善老年人病理性智力减退的症状（记忆力和注意力障...', '2438');
INSERT INTO `medicine` VALUES ('379897014', '清热止咳颗粒', '内服', '清热解毒，燥湿导滞，理气止痛。用于急性肠胃炎，止呕止泻，退热止痛。', '4653');
INSERT INTO `medicine` VALUES ('380068515', '白避瘟散', '内服', '用于受暑受热，头目眩晕，呕吐恶心，晕车晕船。', '238');
INSERT INTO `medicine` VALUES ('380628412', '香连丸', '内服', '用于小儿消化不良及营养障碍等。', '4727');
INSERT INTO `medicine` VALUES ('381179764', '诺氟沙星片', '内服', '用于胃炎、胃溃疡、十二指肠溃疡症状和体征的改善。', '3229');
INSERT INTO `medicine` VALUES ('381370848', '保济油', '内服', '辛凉解表，清热解毒。用于外感风热所致的，发热恶寒，口渴，头痛目赤，咽喉肿痛。', '1839');
INSERT INTO `medicine` VALUES ('381415765', '大黄通便颗粒', '内服', '清热通便。用于实热食滞，便秘以及湿热型食欲不振。', '2679');
INSERT INTO `medicine` VALUES ('381583851', '三奇堂牌京茶', '内服', '祛暑除湿，和胃消食。用于暑湿感冒，恶寒发热，头痛，胸闷，恶心呕吐，不思饮食，腹痛泄泻。', '1104');
INSERT INTO `medicine` VALUES ('382928733', '江中(健胃消食片)', '内服', '健胃消食。用于脾胃虚弱所致的食积，症见不思饮食、嗳腐酸臭、脘腹胀满；消化不良见上述证候者。', '2577');
INSERT INTO `medicine` VALUES ('38302618', '穿心莲内酯软胶囊', '内服', '本品为非甾体抗炎药，仅在至少一种其他非甾体抗炎药治疗失败的情况下使用。可用于慢性关节炎（如骨关节炎等）的疼痛、手术和急性创伤后的疼痛、原发性痛经的症状...', '1957');

-- ----------------------------
-- Table structure for `user`
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `uUsername` varchar(12) NOT NULL,
  `uPassword` varchar(45) DEFAULT NULL,
  `uAccess` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`uUsername`),
  UNIQUE KEY `uUsername_UNIQUE` (`uUsername`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('admin', 'admin', '信息查询功能,信息录入功能,信息删除功能,信息修改功能,信息浏览功能,数据报表功能,用户管理功能');
INSERT INTO `user` VALUES ('test', '1201', '信息查询功能');
INSERT INTO `user` VALUES ('user1', '123456', '信息查询功能');
